
  ___  ____  ____  ____  ____ ©
 /__    /   ____/   /   ____/      17.0
___/   /   /___/   /   /___/       SE—Standard Edition

 Statistics and Data Science       Copyright 1985-2021 StataCorp LLC
                                   StataCorp
                                   4905 Lakeway Drive
                                   College Station, Texas 77845 USA
                                   800-STATA-PC        https://www.stata.com
                                   979-696-4600        stata@stata.com

Stata license: Unlimited-user , expiring 19 Feb 2023
Serial number: 401709301093
  Licensed to: Yuci Zhou
               Princeton University

Notes:
      1. Stata is running in batch mode.
      2. Unicode is supported; see help unicode_advice.
      3. Maximum number of variables is set to 5,000; see help set_maxvar.

. do "prob5.do" 

. clear all

. set scheme Modern

. 
. program main
  1.     prep_data
  2.         svar_run
  3.         export_irf, impulse(I M) response(M) ///
>                 saveas(incomeresponse)
  4.         reducedform_test
  5.         lr_test
  6. end

. 
. program prep_data
  1.     import delimited ../raw/IncomeMoneyGrowth.csv, varnames(1) clear
  2.     rename v1 date_str
  3.     gen date = date(date_str, "MDY")
  4.     gen t = mofd(date)
  5.     format t %tmCCYY/NN
  6.     format date %tdCCYY/NN/DD
  7.         tsset t
  8.         rename (incomegrowth m3growth) (I M)
  9. end

. 
. program svar_run
  1.         matrix rest = (., .) \ (0, .)
  2.         svar I M, lags(1/12) acns(rest)
  3.         matrix A = e(A)
  4. end

. 
. program export_irf
  1.         syntax, impulse(str) response(passthru) saveas(str)
  2.         cap erase test.irf
  3.         irf create test, set(test) step(48)
  4.         
.         foreach i of local impulse {
  5.                 irf graph irf, impulse(`i') `response' ///
>                 title("") note("") subtitle("") caption("") xtitle(Time) ///
>                 ustep(48) legend(off) individual xlabel(0(4)48) ///
>                 ytitle("Income growth response")
  6.                 graph export ../output/`saveas'`i'.pdf, replace
  7.         }
  8. end

. 
. program reducedform_test 
  1.         var I M, lags(1/12) 
  2.         di "Reduced form test on quarterly restrictions"
  3.         
.         test ([I]L1.M * `=A[1,1]' + [M]L1.M * `=A[1,2]' = 0) ///
>         ([I]L2.M * `=A[1,1]'  + [M]L2.I * `=A[1,2]' = 0)
  4. end

. 
. program lr_test
  1.         qui var I M, lags(1/12)
  2.         forval l = 1/12 {
  3.                 if `l' == 1 {
  4.                         foreach V in I M {
  5.                                 local `V'_I ``V'_I' [`V']L`l'.I
  6.                                 local `V'_M ``V'_M' [`V']L`l'.M
  7.                         }
  8.                 }
  9.                 else {
 10.                         foreach V in I M {
 11.                                 local `V'_I ``V'_I' + [`V']L`l'.I
 12.                                 local `V'_M ``V'_M' + [`V']L`l'.M
 13.                         }
 14.                 }
 15.         }
 16.         test (`I_I' = 1) ///
>                 (`I_M' = 0) ///
>                 (`M_I' = 0) ///
>                 (`M_M' = 1) 
 17. end

. 
. * Execute
. main
(encoding automatically selected: ISO-8859-1)
(3 vars, 719 obs)

Time variable: t, 1960/02 to 2019/12
        Delta: 1 month
Estimating short-run parameters

Iteration 0:   log likelihood = -1264.6312  
Iteration 1:   log likelihood =  5521.0708  
Iteration 2:   log likelihood =  5815.6577  
Iteration 3:   log likelihood =  5886.7956  
Iteration 4:   log likelihood =  5889.3246  
Iteration 5:   log likelihood =  5889.3369  
Iteration 6:   log likelihood =  5889.3369  

Structural vector autoregression

 ( 1)  [/A]2_1 = 0
 ( 2)  [/B]1_1 = 1
 ( 3)  [/B]1_2 = 0
 ( 4)  [/B]2_1 = 0
 ( 5)  [/B]2_2 = 1

Sample: 1961/02 thru 2019/12                    Number of obs     =        707
Exactly identified model                        Log likelihood    =   5889.337

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
/A           |
         1_1 |   190.7281   5.072127    37.60   0.000      180.787    200.6693
         2_1 |          0  (constrained)
         1_2 |  -21.54154    13.9767    -1.54   0.123    -48.93536    5.852279
         2_2 |   371.3207   9.874711    37.60   0.000     351.9666    390.6747
-------------+----------------------------------------------------------------
/B           |
         1_1 |          1  (constrained)
         2_1 |          0  (constrained)
         1_2 |          0  (constrained)
         2_2 |          1  (constrained)
------------------------------------------------------------------------------
(file test.irf created)
(file test.irf now active)
(file test.irf updated)
file ../output/incomeresponseI.pdf saved as PDF format
file ../output/incomeresponseM.pdf saved as PDF format

Vector autoregression

Sample: 1961/02 thru 2019/12                    Number of obs     =        707
Log likelihood =   5889.337                     AIC               =  -16.51863
FPE            =   2.30e-10                     HQIC              =    -16.394
Det(Sigma_ml)  =   1.99e-10                     SBIC              =  -16.19607

Equation           Parms      RMSE     R-sq      chi2     P>chi2
----------------------------------------------------------------
I                    25     .005347   0.0934   72.82685   0.0000
M                    25     .002742   0.3912   454.3658   0.0000
----------------------------------------------------------------

------------------------------------------------------------------------------
             | Coefficient  Std. err.      z    P>|z|     [95% conf. interval]
-------------+----------------------------------------------------------------
I            |
           I |
         L1. |  -.1287844   .0372227    -3.46   0.001    -.2017395   -.0558294
         L2. |  -.0385638   .0375594    -1.03   0.305    -.1121789    .0350513
         L3. |  -.0318251   .0375444    -0.85   0.397    -.1054109    .0417606
         L4. |   .0255823   .0374264     0.68   0.494     -.047772    .0989367
         L5. |   .1115746   .0373669     2.99   0.003     .0383368    .1848123
         L6. |   .1050304   .0374198     2.81   0.005      .031689    .1783718
         L7. |   .0600081   .0374377     1.60   0.109    -.0133683    .1333846
         L8. |   .0963372   .0374442     2.57   0.010     .0229479    .1697265
         L9. |   .0357602   .0376158     0.95   0.342    -.0379654    .1094857
        L10. |  -.0005995   .0376184    -0.02   0.987    -.0743301    .0731312
        L11. |  -.0073165   .0375952    -0.19   0.846    -.0810017    .0663687
        L12. |   .1419387   .0371444     3.82   0.000     .0691371    .2147404
             |
           M |
         L1. |  -.0718268   .0733982    -0.98   0.328    -.2156846     .072031
         L2. |  -.0273254   .0804193    -0.34   0.734    -.1849443    .1302936
         L3. |   .1619715   .0806364     2.01   0.045     .0039271    .3200159
         L4. |  -.0625899   .0810821    -0.77   0.440    -.2215079     .096328
         L5. |  -.0343624   .0815291    -0.42   0.673    -.1941565    .1254317
         L6. |  -.1309863   .0814979    -1.61   0.108    -.2907192    .0287467
         L7. |   .1032157   .0816995     1.26   0.206    -.0569123    .2633437
         L8. |  -.0666909   .0814444    -0.82   0.413    -.2263191    .0929373
         L9. |   .2114063   .0806242     2.62   0.009     .0533858    .3694268
        L10. |       .106   .0807139     1.31   0.189    -.0521963    .2641963
        L11. |  -.0542575   .0805933    -0.67   0.501    -.2122174    .1037024
        L12. |  -.0987978   .0732727    -1.35   0.178    -.2424097    .0448141
             |
       _cons |   .0014817   .0005952     2.49   0.013     .0003152    .0026482
-------------+----------------------------------------------------------------
M            |
           I |
         L1. |   .0298757   .0190873     1.57   0.118    -.0075346    .0672861
         L2. |  -.0188488   .0192599    -0.98   0.328    -.0565976       .0189
         L3. |  -.0378481   .0192523    -1.97   0.049    -.0755818   -.0001143
         L4. |  -.0313265   .0191917    -1.63   0.103    -.0689416    .0062885
         L5. |   .0321709   .0191612     1.68   0.093    -.0053843    .0697262
         L6. |  -.0043908   .0191883    -0.23   0.819    -.0419993    .0332176
         L7. |   .0394939   .0191975     2.06   0.040     .0018675    .0771203
         L8. |   .0040682   .0192009     0.21   0.832    -.0335648    .0417012
         L9. |   .0117738   .0192888     0.61   0.542    -.0260316    .0495792
        L10. |   .0170066   .0192902     0.88   0.378    -.0208015    .0548146
        L11. |  -.0044383   .0192783    -0.23   0.818    -.0422231    .0333464
        L12. |   .0223089   .0190471     1.17   0.241    -.0150228    .0596405
             |
           M |
         L1. |   .4491066   .0376375    11.93   0.000     .3753384    .5228749
         L2. |   .0759423   .0412379     1.84   0.066    -.0048825     .156767
         L3. |   .1518833   .0413492     3.67   0.000     .0708403    .2329262
         L4. |  -.1287799   .0415777    -3.10   0.002    -.2102708    -.047289
         L5. |   .1146707    .041807     2.74   0.006     .0327305    .1966109
         L6. |    .037733    .041791     0.90   0.367    -.0441759    .1196418
         L7. |  -.0711592   .0418943    -1.70   0.089    -.1532706    .0109522
         L8. |   .0544977   .0417636     1.30   0.192    -.0273574    .1363528
         L9. |   .1187129    .041343     2.87   0.004     .0376822    .1997436
        L10. |   .0020869   .0413889     0.05   0.960    -.0790339    .0832077
        L11. |  -.0668915   .0413271    -1.62   0.106    -.1478911    .0141081
        L12. |   .0223945   .0375732     0.60   0.551    -.0512477    .0960366
             |
       _cons |   .0011614   .0003052     3.81   0.000     .0005632    .0017596
------------------------------------------------------------------------------
Reduced form test on quarterly restrictions

 ( 1)  190.7281*[I]L.M - 21.54154*[M]L.M = 0
 ( 2)  190.7281*[I]L2.M - 21.54154*[M]L2.I = 0

           chi2(  2) =    3.99
         Prob > chi2 =    0.1358

 ( 1)  [I]L.I + [I]L2.I + [I]L3.I + [I]L4.I + [I]L5.I + [I]L6.I + [I]L7.I +
       [I]L8.I + [I]L9.I + [I]L10.I + [I]L11.I + [I]L12.I = 1
 ( 2)  [I]L.M + [I]L2.M + [I]L3.M + [I]L4.M + [I]L5.M + [I]L6.M + [I]L7.M +
       [I]L8.M + [I]L9.M + [I]L10.M + [I]L11.M + [I]L12.M = 0
 ( 3)  [M]L.I + [M]L2.I + [M]L3.I + [M]L4.I + [M]L5.I + [M]L6.I + [M]L7.I +
       [M]L8.I + [M]L9.I + [M]L10.I + [M]L11.I + [M]L12.I = 0
 ( 4)  [M]L.M + [M]L2.M + [M]L3.M + [M]L4.M + [M]L5.M + [M]L6.M + [M]L7.M +
       [M]L8.M + [M]L9.M + [M]L10.M + [M]L11.M + [M]L12.M = 1

           chi2(  4) =   54.69
         Prob > chi2 =    0.0000

. 
end of do-file
